Autodesk.Revit.DB.PolyLine.Create(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Creates a polyline with coordinate points provided.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the count of coordinates is less than 2.

Autodesk.Revit.DB.PolyLine.Clone
Returns a copy of this polyline.

Autodesk.Revit.DB.PolyLine.GetTransformed(Autodesk.Revit.DB.Transform)
Gets the copy of the polyline which is applied the specified transformation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the transform is null.

Autodesk.Revit.DB.PolyLine.GetOutline
Gets the outline of the polyline.

Autodesk.Revit.DB.PolyLine.GetCoordinates
Gets the coordinate points of the polyline.

Autodesk.Revit.DB.PolyLine.GetCoordinate(System.Int32)
Gets the coordinate point of the specified index.
index: The index of the coordinates.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when the index value is out of range.

Autodesk.Revit.DB.PolyLine.Evaluate(System.Double)
Evaluates a parameter on the polyline.
param: The parameter to be evaluated. It is expected to be in [0,1] interval mapped to the bounds of the whole polyline.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when the param value is not between 0.0 and 1.0.

Autodesk.Revit.DB.PolyLine.NumberOfCoordinates
Gets the number of the coordinate points.

Autodesk.Revit.DB.PolyLine
A polyline.
Remarks: A polyline in space is defined by a set of coordinate points.